Add (theme toggle) :functionality and update styles for dark/light modes
